# This is Assignment 11 - Ben Smith

In [5]:
# Importing
import array
import pandas as pd
import numpy as np

## Requirement 3

#### In your own words, describe the commonalities and differences between NumPy arrays and Pandas series

A Pandas series is a "one-dimensional array of indexed data." In a Pandas series, the index is explicitly defined. By default the index values are integers beginning at 0 and increasing in steps of 1. However, unlike a NumPy array, the indexes of a Pandas series can be explicitly defined as anything the user chooses (e.g. 'a', 'b', 'c', etc.). In this way, a Pandas series more closely resembles a Python dictionary than it does a Numpy array.

## Requirement 4

#### Create a Pandas series named bill_names with American currency bill denominations as indices (keys) and President last names as values

In [6]:
bill_names = pd.Series(['Washington', 'Jefferson', 'Lincoln', 'Hamilton', 'Jackson', 'Grant', 'Franklin'], 
                       index=[1, 2, 5, 10, 20, 50, 100])
print(bill_names)

1      Washington
2       Jefferson
5         Lincoln
10       Hamilton
20        Jackson
50          Grant
100      Franklin
dtype: object

## Requirement 5

#### Create a Pandas series-as-dictionary called beverages_dict. Make the indices beverage names and comments about the beverage as values.

In [7]:
beverages_dict = {'Coffee': 'Energizing',
                  'Soda': 'Refreshing',
                  'Beer': 'Intoxicating',
                  'Milk': 'Calcifying',
                  'Juice': 'Rejuvenating',
                  'Champagne': 'Celebrating',
                  'Wine': 'Fermenting'}
beverages = pd.Series(beverages_dict)
beverages

Coffee         Energizing
Soda           Refreshing
Beer         Intoxicating
Milk           Calcifying
Juice        Rejuvenating
Champagne     Celebrating
Wine           Fermenting
dtype: object

#### Demonstrate accessing individual values via the keys

In [8]:
print(beverages['Coffee'])
print(beverages['Wine'])
print(beverages['Champagne'])

Energizing
Fermenting
Celebrating

#### Demonstrate accessing multiple values via slicing

In [9]:
beverages['Beer':'Juice']

Beer     Intoxicating
Milk       Calcifying
Juice    Rejuvenating
dtype: object

# Requirement 6

#### Obtain the real city proper population data for the following cities: Chongquing, Shanghai, Tokyo, Moscow, Mexico City, London, and New York. Create a series-as-dictionary named population based on this information.

In [10]:
population_dict = {'Chongquing': 8518000, #source: wikipedia.org
                   'Shanghai': 24281400, 
                   'Tokyo': 13929280,
                   'Moscow': 12506468,
                   'Mexico City': 8918653,
                   'London': 8908081,
                   'New York': 8398748}
population = pd.Series(population_dict)
population

Chongquing      8518000
Shanghai       24281400
Tokyo          13929280
Moscow         12506468
Mexico City     8918653
London          8908081
New York        8398748
dtype: int64

# Requirement 7

#### Create a Pandas series-as-dictionary named city_country with the cities in population and the countries for each city

In [11]:
city_country_dict = {'Chongquing': 'China', 
                   'Shanghai': 'China',
                   'Tokyo': 'Japan',
                   'Moscow': 'Russia',
                   'Mexico City': 'Mexico',
                   'London': 'United Kingdom',
                   'New York': 'United States'}
city_country = pd.Series(city_country_dict)
city_country

Chongquing              China
Shanghai                China
Tokyo                   Japan
Moscow                 Russia
Mexico City            Mexico
London         United Kingdom
New York        United States
dtype: object

# Requirement 8

#### Create a Pandas dataframe object named city_dataframe form a dictionary of objects using population and city_country

In [12]:
city_dataframe = pd.DataFrame({'population': population,
                             'city_country': city_country})
city_dataframe

             population    city_country
Chongquing      8518000           China
Shanghai       24281400           China
Tokyo          13929280           Japan
Moscow         12506468          Russia
Mexico City     8918653          Mexico
London          8908081  United Kingdom
New York        8398748   United States

In [13]:
# the .index property
city_dataframe.index

Index(['Chongquing', 'Shanghai', 'Tokyo', 'Moscow', 'Mexico City', 'London',
       'New York'],
      dtype='object')

In [14]:
# the .columns property
city_dataframe.columns

Index(['population', 'city_country'], dtype='object')

In [15]:
#the .keys() method
city_dataframe.keys()

Index(['population', 'city_country'], dtype='object')

# Requirement 9

#### Create a Pandas series object named my_pd_series from a collection of string keys and collection of numeric values of your choosing

In [16]:
my_pd_series = pd.Series({'one': 1, 
                          'two': 2, 
                          'three': 3,
                          'four': 4,
                          'five': 5,
                          'six': 6,
                          'seven': 7})
my_pd_series

one      1
two      2
three    3
four     4
five     5
six      6
seven    7
dtype: int64

In [17]:
# modifying a value based on key
my_pd_series[1] = 22
my_pd_series

one       1
two      22
three     3
four      4
five      5
six       6
seven     7
dtype: int64

In [18]:
# slicing by explicit index
my_pd_series.loc['two':'six']

two      22
three     3
four      4
five      5
six       6
dtype: int64

In [19]:
# slicing by implicit integer index 
my_pd_series[2:6]

three    3
four     4
five     5
six      6
dtype: int64

In [20]:
# masking
my_pd_series[(my_pd_series > 4) & (my_pd_series < 6)]

five    5
dtype: int64

In [21]:
# fancy indexing
my_pd_series[['four', 'seven', 'three']]

four     4
seven    7
three    3
dtype: int64

In [22]:
# the loc[] attribute
my_pd_series.loc['one': 'three']

one       1
two      22
three     3
dtype: int64

In [23]:
# the iloc[] attribute
my_pd_series.iloc[0:3]

one       1
two      22
three     3
dtype: int64

# Requirement 10

#### Using city_dataframe, demonstrate:

In [24]:
# access column via dictionary-style indexing of the column name

print(city_dataframe['population'])
print('----------------------------')
print(city_dataframe['city_country'])

Chongquing      8518000
Shanghai       24281400
Tokyo          13929280
Moscow         12506468
Mexico City     8918653
London          8908081
New York        8398748
Name: population, dtype: int64
----------------------------
Chongquing              China
Shanghai                China
Tokyo                   Japan
Moscow                 Russia
Mexico City            Mexico
London         United Kingdom
New York        United States
Name: city_country, dtype: object

In [25]:
# access column via column names that are strings

print(city_dataframe.population)
print('------------------')
print(city_dataframe.city_country)

Chongquing      8518000
Shanghai       24281400
Tokyo          13929280
Moscow         12506468
Mexico City     8918653
London          8908081
New York        8398748
Name: population, dtype: int64
------------------
Chongquing              China
Shanghai                China
Tokyo                   Japan
Moscow                 Russia
Mexico City            Mexico
London         United Kingdom
New York        United States
Name: city_country, dtype: object

In [26]:
# add a new column to the city_dataframe named altitude

altitude = pd.Series({'Chongquing': 244, 
                   'Shanghai': 4,
                   'Tokyo': 40,
                   'Moscow': 156,
                   'Mexico City': 2250,
                   'London': 11,
                   'New York': 10})

city_dataframe = pd.DataFrame({'city_country': city_country,
                               'population': population,
                               'altitude': altitude})

print(city_dataframe)

               city_country  population  altitude
Chongquing            China     8518000       244
Shanghai              China    24281400         4
Tokyo                 Japan    13929280        40
Moscow               Russia    12506468       156
Mexico City          Mexico     8918653      2250
London       United Kingdom     8908081        11
New York      United States     8398748        10

# Requirement 11

#### Create two Pandas series that when added using '+' produce som NaN entries. Use the .add() method and a fill_value to replace the NaN entries.

In [27]:
Series7 = pd.Series([70, 71, 72], index=[2, 3, 4])
Series6 = pd.Series([65, 64, 63], index=[4, 5, 6])
Series6 + Series7

2      NaN
3      NaN
4    137.0
5      NaN
6      NaN
dtype: float64

In [28]:
Series6.add(Series7, fill_value=0)

2     70.0
3     71.0
4    137.0
5     64.0
6     63.0
dtype: float64

# Requirement 12

#### Create two Pandas dataframes that when added using '+' produce some NaN entries.

In [29]:
SeriesM = pd.Series([5, 5, 5, 5, 5])
SeriesN = pd.Series([6, 6, 6, 6, 6])
SeriesO = pd.Series([7, 7, 7, 7, 7])

DataframeP = pd.DataFrame({1: SeriesM,
                           2: SeriesN,
                           3: SeriesO})

print(DataframeP)

   1  2  3
0  5  6  7
1  5  6  7
2  5  6  7
3  5  6  7
4  5  6  7

In [30]:
SeriesQ = pd.Series([8, 8, 8, 8])
SeriesR = pd.Series([9, 9, 9, 9])
SeriesT = pd.Series([10, 10, 10, 10,])

DataframeU = pd.DataFrame({2: SeriesQ,
                           3: SeriesR,
                           4: SeriesT})

print(DataframeU)

   2  3   4
0  8  9  10
1  8  9  10
2  8  9  10
3  8  9  10

In [31]:
DataframeP + DataframeU

    1     2     3   4
0 NaN  14.0  16.0 NaN
1 NaN  14.0  16.0 NaN
2 NaN  14.0  16.0 NaN
3 NaN  14.0  16.0 NaN
4 NaN   NaN   NaN NaN

#### Use the .add() method and fill_value of the mean of one of the dataframes to replace the NaN entries

In [32]:
mean_DataframeP = DataframeP.stack().mean()
DataframeP.add(DataframeU, fill_value=mean_DataframeP)

      1     2     3     4
0  11.0  14.0  16.0  16.0
1  11.0  14.0  16.0  16.0
2  11.0  14.0  16.0  16.0
3  11.0  14.0  16.0  16.0
4  11.0  12.0  13.0   NaN

# Requirement 13

#### Create a two-dimensional NumPy array

In [33]:
rng = np.random.RandomState(42)
A = rng.randint(5, 10, size=(4,4))
A

array([[8, 9, 7, 9],
       [9, 6, 7, 7],
       [7, 9, 8, 7],
       [9, 6, 8, 6]])

#### Demonstrate subtracting row 0 of A from A

In [34]:
A - A[0]

array([[ 0,  0,  0,  0],
       [ 1, -3,  0, -2],
       [-1,  0,  1, -2],
       [ 1, -3,  1, -3]])

# Requirement 14

#### Create a Pandas dataframe

In [35]:
df = pd.DataFrame(A,columns=list('QRST'))
df

   Q  R  S  T
0  8  9  7  9
1  9  6  7  7
2  7  9  8  7
3  9  6  8  6

#### Demonstrate subtracting row 1 of df from df using df.iloc[1]

In [36]:
df - df.iloc[1]

   Q  R  S  T
0 -1  3  0  2
1  0  0  0  0
2 -2  3  1  0
3  0  0  1 -1

# Requirement 15

#### Compare and contrast the two sentinel values Pandas uses to represent missing data

One of the sentinal values is the 'None' object. This can be used only in arrays with data type 'object'. Some drawbacks of this value are that operations on data containing object arrays require more overhead and that many operations will result in an error because addition between 'None' and an integer is undefined. 

The other sentinal value is 'NaN'. This is a special floating-point value. An array containing floating point values can support much faster operations, making the 'NaN' value more useful in many cases. However, operations involving arithmetic still prove problematic, because the results of any operation containing 'NaN' will also be 'NaN'. 

In most cases, Pandas handles both values interchangeably and converts between the two where necessary.

# Requirement 16

#### Demonstrate the %timeit difference between operationas using Python objects and Python integers

In [37]:
for dtype in ['object', 'int']:
              print("dtype =", dtype)
              %timeit np.arange(1E6, dtype=dtype).min()
              print()

dtype = object
165 ms ± 42 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

dtype = int
6.99 ms ± 181 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

# Requirement 17

#### Create a Pandas Series containing null data. Use .isnull() to identify the entries that are null

In [38]:
AB = pd.Series([11, 12, np.nan, 13, 14, 15, np.nan])

In [39]:
AB.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
dtype: bool

# Requirement 18

#### Create a Pandas dataframe containing null values.

In [40]:
dataframeY = pd.DataFrame([[7,      np.nan, 11],
                   [6,      12,      17],
                   [np.nan, 6,      18]])
dataframeY

     0     1   2
0  7.0   NaN  11
1  6.0  12.0  17
2  NaN   6.0  18

#### Demonstrate:

In [41]:
# drop all rows containing a null value

dataframeY.dropna()

     0     1   2
1  6.0  12.0  17

In [42]:
# drop all columns containing a null value

dataframeY.dropna(axis='columns')

    2
0  11
1  17
2  18

In [43]:
dataframeY[:1] = np.nan   # creating a row with all null values
dataframeY

     0     1     2
0  NaN   NaN   NaN
1  6.0  12.0  17.0
2  NaN   6.0  18.0

In [44]:
# drop only rows that contain all null values

dataframeY.dropna(how='all')

     0     1     2
1  6.0  12.0  17.0
2  NaN   6.0  18.0

In [45]:
dataframeY[1] = np.nan  # creating a column with all null values
dataframeY

     0   1     2
0  NaN NaN   NaN
1  6.0 NaN  17.0
2  NaN NaN  18.0

In [46]:
# drop only columns that contain all null values

dataframeY.dropna(axis='columns', how='all')

     0     2
0  NaN   NaN
1  6.0  17.0
2  NaN  18.0

In [47]:
# replacing null with 0 

dataframeY.fillna(0)

     0    1     2
0  0.0  0.0   0.0
1  6.0  0.0  17.0
2  0.0  0.0  18.0

In [48]:
# forward-fill

dataframeY.fillna(method='ffill')

     0   1     2
0  NaN NaN   NaN
1  6.0 NaN  17.0
2  6.0 NaN  18.0

In [49]:
# backward fill

dataframeY.fillna(method='bfill')

     0   1     2
0  6.0 NaN  17.0
1  6.0 NaN  17.0
2  NaN NaN  18.0

# Requirement 19

#### Demonstrate Pandas MultiIndex techniques (can use book examples)

In [50]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [51]:
# .from_tuples()

index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [52]:
# .reindex()

pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [53]:
# .unstack()

pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [54]:
# .stack()

pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [55]:
# indexing

pop['Texas']

2000    20851820
2010    25145561
dtype: int64

In [56]:
# slicing

pop.loc['New York':'Texas']

New York  2000    18976457
          2010    19378102
Texas     2000    20851820
          2010    25145561
dtype: int64

# Requirement 20

#### Demonstrate concatenating two Pandas series. One series contains automobile data. the other series contains motorcycle data.

In [57]:
autos = pd.Series(['F150', 'Wrangler', 'Outlander'],
                  index=['Ford', 'Jeep', 'Subaru'])
motos = pd.Series(['Ninja', 'Street Glide', 'Grom'],
                  index=['Kawasaki', 'Harley Davidson', 'Honda'])

display(autos, motos, pd.concat([autos, motos]))

Ford           F150
Jeep       Wrangler
Subaru    Outlander
dtype: object

Kawasaki                  Ninja
Harley Davidson    Street Glide
Honda                      Grom
dtype: object

Ford                       F150
Jeep                   Wrangler
Subaru                Outlander
Kawasaki                  Ninja
Harley Davidson    Street Glide
Honda                      Grom
dtype: object

# Requirement 21

#### Demonstrate concatenating two Pandas dataframes using the .append() method

In [58]:
display(autos, motos, autos.append(motos))

Ford           F150
Jeep       Wrangler
Subaru    Outlander
dtype: object

Kawasaki                  Ninja
Harley Davidson    Street Glide
Honda                      Grom
dtype: object

Ford                       F150
Jeep                   Wrangler
Subaru                Outlander
Kawasaki                  Ninja
Harley Davidson    Street Glide
Honda                      Grom
dtype: object

# Requirement 22

#### Using Pandas dataframes, demonstrate the following joins:

In [59]:
df1 = pd.DataFrame({'employee': ['Oscar', 'Jim', 'Dwight', 'Toby'],
                    'group': ['Accounting', 'Sales', 'Sales', 'HR']})
df2 = pd.DataFrame({'employee': ['Oscar', 'Jim', 'Dwight', 'Toby'],
                    'last_name': ['Martinez', 'Halpert', 'Schrute', 'Flenderson']})
display(df1, df2)

  employee       group
0    Oscar  Accounting
1      Jim       Sales
2   Dwight       Sales
3     Toby          HR

  employee   last_name
0    Oscar    Martinez
1      Jim     Halpert
2   Dwight     Schrute
3     Toby  Flenderson

In [60]:
# one-to-one

df3 = pd.merge(df1, df2)
df3

  employee       group   last_name
0    Oscar  Accounting    Martinez
1      Jim       Sales     Halpert
2   Dwight       Sales     Schrute
3     Toby          HR  Flenderson

In [61]:
# many-to-one

df4 = pd.DataFrame({'group': ['Accounting', 'Sales', 'HR'], 
                   'senior_member': ['Angela', 'Dwight', 'Toby']})

display(df3, df4, pd.merge(df3, df4))

  employee       group   last_name
0    Oscar  Accounting    Martinez
1      Jim       Sales     Halpert
2   Dwight       Sales     Schrute
3     Toby          HR  Flenderson

        group senior_member
0  Accounting        Angela
1       Sales        Dwight
2          HR          Toby

  employee       group   last_name senior_member
0    Oscar  Accounting    Martinez        Angela
1      Jim       Sales     Halpert        Dwight
2   Dwight       Sales     Schrute        Dwight
3     Toby          HR  Flenderson          Toby

In [62]:
# many-to-many

df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Sales', 'Sales', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'communication', 'prospecting',
                               'spreadsheets', 'organization']})
display(df1, df5, pd.merge(df1, df5))

  employee       group
0    Oscar  Accounting
1      Jim       Sales
2   Dwight       Sales
3     Toby          HR

        group         skills
0  Accounting           math
1  Accounting   spreadsheets
2       Sales  communication
3       Sales    prospecting
4          HR   spreadsheets
5          HR   organization

  employee       group         skills
0    Oscar  Accounting           math
1    Oscar  Accounting   spreadsheets
2      Jim       Sales  communication
3      Jim       Sales    prospecting
4   Dwight       Sales  communication
5   Dwight       Sales    prospecting
6     Toby          HR   spreadsheets
7     Toby          HR   organization

# Requirement 23

#### Using Pandas dataframes, demonstrate merge with the following keywords:

In [63]:
# on

display(df1, df2, pd.merge(df1, df2, on='employee'))

  employee       group
0    Oscar  Accounting
1      Jim       Sales
2   Dwight       Sales
3     Toby          HR

  employee   last_name
0    Oscar    Martinez
1      Jim     Halpert
2   Dwight     Schrute
3     Toby  Flenderson

  employee       group   last_name
0    Oscar  Accounting    Martinez
1      Jim       Sales     Halpert
2   Dwight       Sales     Schrute
3     Toby          HR  Flenderson

In [64]:
# left_on and right_on

df6 = pd.DataFrame({'name': ['Oscar', 'Jim', 'Dwight', 'Toby'],
                    'salary': [45000, 60000, 55000, 55000]})

df7 = pd.merge(df1, df6, left_on='employee', right_on='name')

display(df1, df6, df7)

  employee       group
0    Oscar  Accounting
1      Jim       Sales
2   Dwight       Sales
3     Toby          HR

     name  salary
0   Oscar   45000
1     Jim   60000
2  Dwight   55000
3    Toby   55000

  employee       group    name  salary
0    Oscar  Accounting   Oscar   45000
1      Jim       Sales     Jim   60000
2   Dwight       Sales  Dwight   55000
3     Toby          HR    Toby   55000

In [65]:
df7.drop('name', axis=1)

  employee       group  salary
0    Oscar  Accounting   45000
1      Jim       Sales   60000
2   Dwight       Sales   55000
3     Toby          HR   55000

In [66]:
#left_index and right_index

df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
display(df1a, df2a, pd.merge(df1a, df2a, left_index=True, right_index=True))

               group
employee
Oscar     Accounting
Jim            Sales
Dwight         Sales
Toby              HR

           last_name
employee
Oscar       Martinez
Jim          Halpert
Dwight       Schrute
Toby      Flenderson

               group   last_name
employee
Oscar     Accounting    Martinez
Jim            Sales     Halpert
Dwight         Sales     Schrute
Toby              HR  Flenderson

# Requirement 24

With this assignment, it is beginning to become more clear the ways in which Python and its various packages would be useful for manipulating and analyzing data. However, I have yet to see many techniques/methods that would not be (for me at least) much simpler and more intuitive in a program like excel. I know that Python and similar languages are tools that can prove much more flexible and powerful than a spreadsheet software, but as of yet it is hard for me to understand how. I am looking forward to diving deeper, and I'm sure eventually it will "click" for me just how useful these tools can be.